artemstukalenko/stm32-black-box/Core/App/app_main.cpp
#include "app_main.h"
#include "main.h"
#include "usart.h"
#include "cmsis_os.h"
#include <string.h>
#include <stdio.h>

#include <HardwareInterface/I2C/Stm32I2CBus.h>
#include <HardwareInterface/UART/Stm32UartBus.h>
#include <HardWareInterface/FatFS/OverwritingFatFS.h>

#include "Logger/Impl/FatFSLogger.h"
#include "Sensor/ISensor.h"
#include "Sensor/Barometer/Barometer.h"
#include "Sensor/GPS/Gps.h"

#define MAX_LOG_MSG_LENGTH 64
#define SENSOR_COUNT 2

extern I2C_HandleTypeDef hi2c1;

struct LogMessage {
	char data[MAX_LOG_MSG_LENGTH];
};

Stm32I2CBus i2cBus(&hi2c1);
Barometer barometer(&i2cBus);

Stm32UartBus uartBus(&huart2);
Gps gps(&uartBus);

ISensor* sensors[] = {&barometer, &gps};

OverwritingFatFS fatfs;
FatFSLogger logger(&fatfs);

osMessageQueueId_t logQueueHandle;
osThreadId_t sensorTaskHandle;
osThreadId_t loggerTaskHandle;


const osThreadAttr_t sensorTask_attributes = {
		.name = "SensorTask",
		.stack_size = 256 * 4,
		.priority = (osPriority_t) osPriorityNormal,
};

const osThreadAttr_t loggerTask_attributes = {
		.name = "LoggerTask",
		.stack_size = 256 * 4,
		.priority = (osPriority_t) osPriorityBelowNormal
};


void SensorTask(void* parameters) {
	ISensor* sensor = static_cast<ISensor*>(parameters);
	uint32_t delay = sensor->getDelay();

	for(;;) {
		if (sensor != nullptr) {
			sensor->update();
			const char* dataStr = sensor->getDataString();

			LogMessage message;
			strncpy(message.data, dataStr, MAX_LOG_MSG_LENGTH - 1);
			message.data[MAX_LOG_MSG_LENGTH - 1] = '\0';

			osMessageQueuePut(logQueueHandle, &message, 0, 0);

			osDelay(delay);
		}
	}
}

void LoggerTask(void *argument) {
	LogMessage receviedMessage;

	for(;;) {
		if (osMessageQueueGet(logQueueHandle, &receviedMessage, NULL, osWaitForever) == osOK) {
			logger.writeLog(receviedMessage.data);
			logger.sync();
		}
	}
}


void app_main_task(void *argument) {
	if (logger.init()) {
		logger.writeLog("[SYS] Logger initialized.");
	}

	for (int i = 0; i < SENSOR_COUNT; i++) {
		char stringBuffer[64];
		const char* messageTemplate = "[SYS] %s %s\r\n";
		if (sensors[i]->init()) {
			snprintf(stringBuffer, sizeof(stringBuffer), messageTemplate,
					sensors[i]->getName(), "initialized.");
			logger.writeLog(stringBuffer);
		} else {
			snprintf(stringBuffer, sizeof(stringBuffer), messageTemplate,
								sensors[i]->getName(), "failed initialization.");
			logger.writeLog(stringBuffer);
		}
	}

	logger.writeLog("[SYS] BlackBox started.\r\n");
	logger.writeLog("*************************\r\n");
	logger.sync();

	logQueueHandle = osMessageQueueNew(10, sizeof(LogMessage), NULL);

	for (int i = 0; i < SENSOR_COUNT; i++) {
		osThreadNew(SensorTask, sensors[i], &sensorTask_attributes);
	}

	loggerTaskHandle = osThreadNew(LoggerTask, NULL, &loggerTask_attributes);

	while(1) {
		HAL_GPIO_TogglePin(LED_BUILTIN_GPIO_Port, LED_BUILTIN_Pin);
		osDelay(100);
		HAL_GPIO_TogglePin(LED_BUILTIN_GPIO_Port, LED_BUILTIN_Pin);
		osDelay(1900);
	}
}

extern "C" void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart->Instance == USART2) {
		gps.handleRxInterrupt();
	}
}
